app/controllers/data_nodes_controller.rb

	def index
		@data_nodes = DataNode.all
---
SELECT "data_nodes".* FROM "data_nodes"

	def create
		@data_node = DataNode.new(data_node_params)

		respond_to do |format|
			if @data_node.save
---
INSERT INTO "data_nodes" ("value", "faction_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["value", 3], ["faction_id", 0], ["created_at", "2017-09-17 10:58:26.492539"], ["updated_at", "2017-09-17 10:58:26.492539"]]

	def update
		respond_to do |format|
			if @data_node.update(data_node_params)
---
UPDATE "data_nodes" SET "faction_id" = ?, "updated_at" = ? WHERE "data_nodes"."id" = ?  [["faction_id", 1], ["updated_at", "2017-09-17 10:58:33.251222"], ["id", 1]]

	def destroy
		@data_node.destroy
---
DELETE FROM "data_nodes" WHERE "data_nodes"."id" = ?  [["id", 7]]

	def request_nodes
		out = {'nodes' => {}}
		ranges = params['ranges']
		num = ranges.count
		print num
		i = 0
		while (i < num)
			range = ranges[i.to_s]
			cur = range[:from].to_i
			while (cur <= range[:to].to_i)
				curNode = DataNode.where(value: cur).first
---
SELECT  "data_nodes".* FROM "data_nodes" WHERE "data_nodes"."value" = ? ORDER BY "data_nodes"."id" ASC LIMIT ?  [["value", 1], ["LIMIT", 1]]

	def set_data_node
		@data_node = DataNode.find(params[:id])
---
SELECT  "data_nodes".* FROM "data_nodes" WHERE "data_nodes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]