app/controllers/effects_controller.rb

SELECT "effects".* FROM "effects"
---
  def index
    @effects = Effect.all

INSERT INTO "effects" ("effect_name", "clearence_value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["effect_name", "attack"], ["clearence_value", 25000], ["created_at", "2017-09-20 01:21:26.843214"], ["updated_at", "2017-09-20 01:21:26.843214"]]
---
  def create
    @effect = Effect.new(effect_params)

    respond_to do |format|
      if @effect.save

SELECT  "effects".* FROM "effects" WHERE "effects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_effect
      @effect = Effect.find(params[:id])