app/controllers/factions_controller.rb

SELECT "factions".* FROM "factions"
---
  def index
    @factions = Faction.all

INSERT INTO "factions" ("faction_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["faction_name", "Red"], ["created_at", "2017-09-19 22:05:42.155131"], ["updated_at", "2017-09-19 22:05:42.155131"]]
---
  def create
    @faction = Faction.new(faction_params)

    respond_to do |format|
      if @faction.save

UPDATE "factions" SET "faction_name" = ?, "updated_at" = ? WHERE "factions"."id" = ?  [["faction_name", "Neutral"], ["updated_at", "2017-09-19 22:06:45.297807"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @faction.update(faction_params)

SELECT  "factions".* FROM "factions" WHERE "factions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_faction
      @faction = Faction.find(params[:id])