app/controllers/home_controller.rb

SELECT "news_posts".* FROM "news_posts"
---
  def index
    @news_posts = NewsPost.all