app/controllers/interactions_controller.rb

	def index
		@interactions = Interaction.all
---
SELECT "interactions".* FROM "interactions"

	def create
		@interaction = Interaction.new(interaction_params)

		respond_to do |format|
			if @interaction.save
---
INSERT INTO "interactions" ("user_id", "effect_id", "origin_node_id", "target_node_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["effect_id", 2], ["origin_node_id", 1], ["target_node_id", 1], ["created_at", "2017-09-20 03:08:40.400619"], ["updated_at", "2017-09-20 03:08:40.400619"]]

	def destroy
		@interaction.destroy
---
DELETE FROM "interactions" WHERE "interactions"."id" = ?  [["id", 1]]

	def take_action
		valid = check_valid(params)
		if valid == 0
			origin = DataNode.where(value: params['origin']).first
			target = DataNode.where(value: params['target']).first
			effect = Effect.find(params['effect'])
			case effect.effect_name
			when 'attack'
				unless target.nil? || target == 0
					target.faction_id = origin.faction_id
					target.save
				else
					@n = DataNode.new
					@n.value = params['target']
					@n.faction_id = origin.faction_id
					@n.save
---
SELECT  "data_nodes".* FROM "data_nodes" WHERE "data_nodes"."value" = ? ORDER BY "data_nodes"."id" ASC LIMIT ?  [["value", 7], ["LIMIT", 1]]
SELECT  "effects".* FROM "effects" WHERE "effects"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "data_nodes" SET "faction_id" = ?, "updated_at" = ? WHERE "data_nodes"."id" = ?  [["faction_id", 1], ["updated_at", "2017-09-20 07:47:46.962622"], ["id", 7]]
INSERT INTO "data_nodes" ("value", "faction_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["value", 14], ["faction_id", 2], ["created_at", "2017-09-20 07:47:41.948774"], ["updated_at", "2017-09-20 07:47:41.948774"]]

	def set_interaction
		@interaction = Interaction.find(params[:id])
---
SELECT  "interactions".* FROM "interactions" WHERE "interactions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]