app/controllers/play_controller.rb

	def index
		factions = ["", "red", "blue", "green", ""]
		@classes = []
		iter = 1
		while iter <= 32 do
			name = "elem"
			elem = DataNode.where(value: iter).first
			unless elem.nil? || elem == 0
				index = elem.faction_id
				name += " " + factions[index]
			end
			@classes.push(name)
			iter += 1
		end
		@user = User.find(current_user.id)
---
SELECT  "data_nodes".* FROM "data_nodes" WHERE "data_nodes"."value" = ? ORDER BY "data_nodes"."id" ASC LIMIT ?  [["value", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]