app/controllers/site_controller.rb

	def index
		@factions = ["", "red", "blue", "green"]
		@nodes = []
		(1...32).each do |iter|
			name = "elem"
			node = DataNode.where(value: iter)
			if (node.exists?)
---
SELECT  "data_nodes".* FROM "data_nodes" WHERE "data_nodes"."value" = ? ORDER BY "data_nodes"."id" ASC LIMIT ?  [["value", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "data_nodes" WHERE "data_nodes"."value" = ? LIMIT ?  [["value", 1], ["LIMIT", 1]]