app/views/data_nodes/index.html.erb

SELECT  "factions".* FROM "factions" WHERE "factions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% if user_signed_in? %>
  Welcome, <%= current_user.username %>! You are a part of the <%= Faction.find(current_user.faction_id).faction_name %> faction.<br>