app/controllers/users/registrations_controller.rb

  def faction
    @user = User.find(current_user.id)
    @user.update(params.permit(:faction_id))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "faction_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["faction_id", 2], ["updated_at", "2017-09-19 22:07:16.806372"], ["id", 1]]